Tekla Open API Reference for Tekla Structures 2025
ComponentInput.AddTwoInputPositions Method
 Adds two input positions to the component input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddTwoInputPositions(
	Point Position1,
	Point Position2
)
Public Function AddTwoInputPositions (
	Position1 As Point,
	Position2 As Point
) As Boolean
Parameters
Position1
Type: Tekla.Structures.Geometry3d.Point
The first position to be added.
Position2
Type: Tekla.Structures.Geometry3d.Point
The second position to be added.
Return Value
Type: Boolean
True on success.
See Also
Reference
ComponentInput Class
Tekla.Structures.Model Namespace